Documents/ВводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПереданныеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пай</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтратегииИндивидуальногоИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СтратегииИндивидуальногоИнвестирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокерскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКодУБрокера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСтавкаВознагражденияУправляющего</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаВознагражденияУправляющегоПлатаЗаРазмещение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяПериодичностьРасчетаВознагражденияЗаУправление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьРасчетаВознагражденияУправляющего</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяБазаДляРасчетаВознагражденияЗаУправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стандартная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействияСтратегии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействияСтратегии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаУтвержденияСтратегии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаУтвержденияСтратегии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаПрекращенияСтратегии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаПрекращенияСтратегии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеРасчетныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеРасчетныеСчетаБрокера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеДепозитарныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВводДенежныхСредств/Ext/ManagerModule.bsl
// Проверяет соответствие реквизитов начисления задолженности по вознаграждению за размещение и его основания
//
// Параметры:
//	НачислениеЗадолженности      - ДокументОбъект.НачислениеЗадолженности, ДокументСсылка.НачислениеЗадолженности - документ начисления задолженности, сформированный на основании ввода д/с
//	Дата                         - Дата - дата, на которую определяется ставка вознаграждения
//	СчетДоверительногоУправления - СправочникСсылка.СчетДоверительногоУправления - счет д/у, для стратегии которого определяется ставка вознаграждения
//
Функция НачислениеВознагражденияЗаРазмещениеТребуетСинхронизации(НачислениеЗадолженности, Дата, СчетДоверительногоУправления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТипНачисленияЗадолженности = ТипЗнч(НачислениеЗадолженности);
	
	// поместим в запрос данные по начислению задолженности
	Если ТипНачисленияЗадолженности = Тип("ДокументОбъект.НачислениеЗадолженности") Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&Ссылка КАК Ссылка,
			|	&Дата КАК Дата,
			|	&Организация КАК Организация,
			|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	&РасчетныйСчет КАК РасчетныйСчет,
			|	&Валюта КАК Валюта,
			|	&Вознаграждение КАК Вознаграждение,
			|	&Контрагент КАК Контрагент,
			|	&ВидЗадолженности КАК ВидЗадолженности,
			|	&ПометкаУдаления КАК ПометкаУдаления,
			|	НачислениеЗадолженностиОснования.Основание КАК Основание,
			|	НачислениеЗадолженностиОснования.Сумма КАК Сумма
			|ПОМЕСТИТЬ _НачислениеЗадолженности
			|ИЗ
			|	&ТаблицаОснований КАК НачислениеЗадолженностиОснования";
		
		Запрос.УстановитьПараметр("Ссылка", 						НачислениеЗадолженности.Ссылка);
		Запрос.УстановитьПараметр("Дата", 							НачислениеЗадолженности.Дата);
		Запрос.УстановитьПараметр("Организация", 					НачислениеЗадолженности.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	НачислениеЗадолженности.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("РасчетныйСчет", 					НачислениеЗадолженности.РасчетныйСчет);
		Запрос.УстановитьПараметр("Валюта", 						НачислениеЗадолженности.Валюта);
		Запрос.УстановитьПараметр("Вознаграждение", 				НачислениеЗадолженности.Вознаграждение);
		Запрос.УстановитьПараметр("Контрагент", 					НачислениеЗадолженности.Контрагент);
		Запрос.УстановитьПараметр("ВидЗадолженности", 				НачислениеЗадолженности.ВидЗадолженности);
		Запрос.УстановитьПараметр("ПометкаУдаления", 				НачислениеЗадолженности.ПометкаУдаления);
		Запрос.УстановитьПараметр("ТаблицаОснований", 				НачислениеЗадолженности.Основания.Выгрузить());
		
	ИначеЕсли ТипНачисленияЗадолженности = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачислениеЗадолженности.Ссылка КАК Ссылка,
			|	НачислениеЗадолженности.Дата КАК Дата,
			|	НачислениеЗадолженности.Организация КАК Организация,
			|	НачислениеЗадолженности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НачислениеЗадолженности.РасчетныйСчет КАК РасчетныйСчет,
			|	НачислениеЗадолженности.Валюта КАК Валюта,
			|	НачислениеЗадолженности.Вознаграждение КАК Вознаграждение,
			|	НачислениеЗадолженности.Контрагент КАК Контрагент,
			|	НачислениеЗадолженности.ВидЗадолженности КАК ВидЗадолженности,
			|	НачислениеЗадолженности.ПометкаУдаления КАК ПометкаУдаления,
			|	НачислениеЗадолженностиОснования.Основание КАК Основание,
			|	НачислениеЗадолженностиОснования.Сумма КАК Сумма
			|ПОМЕСТИТЬ _НачислениеЗадолженности
			|ИЗ
			|	Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
			|		ПО (НачислениеЗадолженностиОснования.Ссылка = НачислениеЗадолженности.Ссылка)
			|ГДЕ
			|	НачислениеЗадолженности.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", НачислениеЗадолженности);
		
	Иначе
		
		ВызватьИсключение "Передан документ-начисление некорректного типа " + ТипНачисленияЗадолженности;
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
	// найдем расхождения, требущие синхронизации
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НеПроверятьСоответствиеДатыВводуДенежныхСредств.Значение КАК НеПроверятьСоответствиеДатыВводуДенежныхСредств,
		|	НАЧАЛОПЕРИОДА(_НачислениеЗадолженности.Дата, ДЕНЬ) КАК НачислениеЗадолженности_Дата,
		|	НАЧАЛОПЕРИОДА(ВводДенежныхСредств.Дата, ДЕНЬ) КАК ВводДенежныхСредств_Дата,
		|	_НачислениеЗадолженности.Организация КАК НачислениеЗадолженности_Организация,
		|	ВводДенежныхСредств.Организация КАК ВводДенежныхСредств_Организация,
		|	_НачислениеЗадолженности.СчетДоверительногоУправления КАК НачислениеЗадолженности_СчетДоверительногоУправления,
		|	ВводДенежныхСредств.СчетДоверительногоУправления КАК ВводДенежныхСредств_СчетДоверительногоУправления,
		|	_НачислениеЗадолженности.РасчетныйСчет КАК НачислениеЗадолженности_РасчетныйСчет,
		|	ВводДенежныхСредств.РасчетныйСчет КАК ВводДенежныхСредств_РасчетныйСчет,
		|	_НачислениеЗадолженности.Валюта КАК НачислениеЗадолженности_Валюта,
		|	ВводДенежныхСредств.Валюта КАК ВводДенежныхСредств_Валюта,
		|	_НачислениеЗадолженности.Контрагент КАК НачислениеЗадолженности_Контрагент,
		|	ВводДенежныхСредств.Организация.ЮрФизЛицо КАК ВводДенежныхСредств_Контрагент,
		|	_НачислениеЗадолженности.Сумма КАК НачислениеЗадолженности_Сумма,
		|	ВЫРАЗИТЬ(ВводДенежныхСредств.Сумма * &СтавкаВознагражденияУправляющегоПлатаЗаРазмещение / 100 КАК ЧИСЛО(15, 2)) КАК ВводДенежныхСредств_Сумма,
		|	_НачислениеЗадолженности.Вознаграждение КАК НачислениеЗадолженности_Вознаграждение,
		|	ИСТИНА КАК ВводДенежныхСредств_Вознаграждение,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|					КОГДА НеПроверятьСоответствиеДатыВводуДенежныхСредств.Значение = ИСТИНА
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ НАЧАЛОПЕРИОДА(_НачислениеЗадолженности.Дата, ДЕНЬ) <> НАЧАЛОПЕРИОДА(ВводДенежныхСредств.Дата, ДЕНЬ)
		|				КОНЕЦ
		|				ИЛИ _НачислениеЗадолженности.Организация <> ВводДенежныхСредств.Организация
		|				ИЛИ _НачислениеЗадолженности.СчетДоверительногоУправления <> ВводДенежныхСредств.СчетДоверительногоУправления
		|				ИЛИ _НачислениеЗадолженности.РасчетныйСчет <> ВводДенежныхСредств.РасчетныйСчет
		|				ИЛИ _НачислениеЗадолженности.Валюта <> ВводДенежныхСредств.Валюта
		|				ИЛИ _НачислениеЗадолженности.Вознаграждение <> ИСТИНА
		|				ИЛИ _НачислениеЗадолженности.Контрагент <> ВводДенежныхСредств.Организация.ЮрФизЛицо
		|				ИЛИ _НачислениеЗадолженности.Сумма <> (ВЫРАЗИТЬ(ВводДенежныхСредств.Сумма * &СтавкаВознагражденияУправляющегоПлатаЗаРазмещение / 100 КАК ЧИСЛО(15, 2)))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяСинхронизация
		|ИЗ
		|	_НачислениеЗадолженности КАК _НачислениеЗадолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
		|		ПО (ВводДенежныхСредств.Ссылка = _НачислениеЗадолженности.Основание)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК НеПроверятьСоответствиеДатыВводуДенежныхСредств
		|		ПО (НеПроверятьСоответствиеДатыВводуДенежныхСредств.Объект = _НачислениеЗадолженности.Ссылка)
		|			И (НеПроверятьСоответствиеДатыВводуДенежныхСредств.Свойство.Ключ = ""НачислениеЗадолженностиПоВознаграждениюУправляющегоПлатаЗаРазмещение.НеПроверятьСоответствиеДатыВводуДенежныхСредств"")
		|ГДЕ
		|	_НачислениеЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение)
		|	И НЕ _НачислениеЗадолженности.ПометкаУдаления";
			
	Запрос.УстановитьПараметр("СтавкаВознагражденияУправляющегоПлатаЗаРазмещение",
		Справочники.СтратегииИндивидуальногоИнвестирования.ПолучитьСтавкуВознагражденияУправляющегоПлатуЗаРазмещение(Дата, СчетДоверительногоУправления));
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТребуетсяСинхронизация;
	КонецЕсли;

	// Если документ начисления отсутствует, синхронизация тоже требуется

	Возврат Истина;
	
КонецФункции

Функция ТребуетсяНачислениеВознагражденияЗаРазмещение(Дата, СчетДоверительногоУправления, ВидОперации) Экспорт
	
	Возврат
		ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление
			И (Справочники.СтратегииИндивидуальногоИнвестирования.ПолучитьСтавкуВознагражденияУправляющегоПлатуЗаРазмещение(Дата, СчетДоверительногоУправления) > 0);
	
КонецФункции // ТребуетсяНачислениеВознагражденияЗаРазмещение

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭтоВводПоОбменуПаев = ТипЗнч(Данные.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Основание, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен;
	
	Представление = СтрШаблон("Ввод денежных средств%1 %2 от %3", 
		?(ЭтоВводПоОбменуПаев, " по обмену паев", ""),
		СокрЛП(Данные.Номер),
		Данные.Дата);
		
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Основание");
		
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
